lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/app/rcu/rcu_gap.c
            if (GAP_CAUSE_SUCCESS == le_adv_start())
            {
                APP_PRINT_INFO0("rcu start ADV_UNDIRECT_POWER success!");
                app_global_data.rcu_status = RCU_STATUS_ADVERTISING;
                app_global_data.adv_type = ADV_UNDIRECT_POWER;
                os_timer_restart(&adv_timer, ADV_UNDIRECT_POWER_TIMEOUT);
                result = true;
            }
            else
            {
                APP_PRINT_WARN0("rcu start ADV_UNDIRECT_POWER fail!");
            }
        }
        break;

    case ADV_UNDIRECT_PAIRING:
        {
            PROFILE_PRINT_INFO0("ADV_UNDIRECT_PAIRING for pairing!");
#if FEATURE_SUPPORT_REMOVE_LINK_KEY_BEFORE_PAIRING
            if (app_global_data.is_link_key_existed)
            {
#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
                get_bond_info();
#endif
                app_global_data.is_link_key_existed = false;
                le_bond_clear_all_keys();
            }
#endif
#if FEATURE_SUPPORT_PRIVACY
            if (app_privacy_resolution_state == PRIVACY_ADDR_RESOLUTION_ENABLED)
            {
                privacy_set_addr_resolution(false);
            }
#endif
            adv_event_type = GAP_ADTYPE_ADV_IND;
            adv_channel_map = GAP_ADVCHAN_ALL;
            adv_filter_policy = GAP_ADV_FILTER_ANY;
            adv_interval_min = 0x20;  /* 20ms */
            adv_interval_max = 0x30;  /* 30ms */

            le_adv_set_param(GAP_PARAM_ADV_EVENT_TYPE, sizeof(adv_event_type), &adv_event_type);
            le_adv_set_param(GAP_PARAM_ADV_CHANNEL_MAP, sizeof(adv_channel_map), &adv_channel_map);
            le_adv_set_param(GAP_PARAM_ADV_FILTER_POLICY, sizeof(adv_filter_policy), &adv_filter_policy);
            le_adv_set_param(GAP_PARAM_ADV_INTERVAL_MIN, sizeof(adv_interval_min), &adv_interval_min);
            le_adv_set_param(GAP_PARAM_ADV_INTERVAL_MAX, sizeof(adv_interval_max), &adv_interval_max);
            le_adv_set_param(GAP_PARAM_ADV_DATA, sizeof(app_pairing_adv_data), app_pairing_adv_data);
            le_adv_set_param(GAP_PARAM_SCAN_RSP_DATA, sizeof(app_scan_rsp_data), app_scan_rsp_data);

            if (GAP_CAUSE_SUCCESS == le_adv_start())
            {
                APP_PRINT_INFO0("rcu start ADV_UNDIRECT_PAIRING success!");
                app_global_data.rcu_status = RCU_STATUS_ADVERTISING;
                app_global_data.adv_type = ADV_UNDIRECT_PAIRING;
                os_timer_restart(&adv_timer, ADV_UNDIRECT_PAIRING_TIMEOUT);
                LED_BLINK(LED_1, LED_TYPE_BLINK_PAIR_ADV, 0);
                result = true;
            }
            else
            {
                APP_PRINT_WARN0("rcu start ADV_UNDIRECT_PAIRING fail!");
            }
        }
        break;

    case ADV_UNDIRECT_PROMPT:
        PROFILE_PRINT_INFO0("ADV_UNDIRECT_PROMPT for prompt!");
#if FEATURE_SUPPORT_PRIVACY
        if (app_privacy_resolution_state == PRIVACY_ADDR_RESOLUTION_DISABLED)
        {

            privacy_set_addr_resolution(true);
        }
#endif
        adv_event_type = GAP_ADTYPE_ADV_NONCONN_IND;
        adv_channel_map = GAP_ADVCHAN_ALL;
        adv_filter_policy = GAP_ADV_FILTER_WHITE_LIST_ALL;
        adv_interval_min = 0x20;
        adv_interval_max = 0x30;

        le_adv_set_param(GAP_PARAM_ADV_EVENT_TYPE, sizeof(adv_event_type), &adv_event_type);
        le_adv_set_param(GAP_PARAM_ADV_CHANNEL_MAP, sizeof(adv_channel_map), &adv_channel_map);
        le_adv_set_param(GAP_PARAM_ADV_FILTER_POLICY, sizeof(adv_filter_policy), &adv_filter_policy);
        le_adv_set_param(GAP_PARAM_ADV_INTERVAL_MIN, sizeof(adv_interval_min), &adv_interval_min);
        le_adv_set_param(GAP_PARAM_ADV_INTERVAL_MAX, sizeof(adv_interval_max), &adv_interval_max);
        le_adv_set_param(GAP_PARAM_ADV_DATA, sizeof(app_prompt_adv_data), app_prompt_adv_data);
        le_adv_set_param(GAP_PARAM_SCAN_RSP_DATA,  sizeof(app_scan_rsp_data), app_scan_rsp_data);

        if (GAP_CAUSE_SUCCESS == le_adv_start())
        {
            APP_PRINT_INFO0("rcu start ADV_UNDIRECT_PROMPT success!");
            app_global_data.rcu_status = RCU_STATUS_ADVERTISING;
            app_global_data.adv_type = ADV_UNDIRECT_PROMPT;
            os_timer_restart(&adv_timer, ADV_UNDIRECT_PROMPT_TIMEOUT);
            result = true;
        }
        else
        {
            APP_PRINT_WARN0("rcu start ADV_UNDIRECT_PROMPT fail!");
        }
        break;

    default:
        /* invalid adv type */
        APP_PRINT_WARN1("[rcu_start_adv] unknown adv type: %d", adv_type);
        break;
    }

    return result;
}

/**
 * @brief stop advertising
 * @param stop_adv_reason - indicate to the reason to stop adv
 * @return true or false
 * @retval void
 */
bool rcu_stop_adv(T_STOP_ADV_REASON stop_adv_reason)
{
    bool result = false;
    app_global_data.stop_adv_reason = stop_adv_reason;

    if (app_global_data.rcu_status == RCU_STATUS_ADVERTISING)
    {
        if (le_adv_stop() == GAP_CAUSE_SUCCESS)
        {
            APP_PRINT_INFO0("[rcu_stop_adv] stop adv command sent successfully");
            app_global_data.rcu_status = RCU_STATUS_STOP_ADVERTISING;
            result = true;
        }
        else
        {
            APP_PRINT_WARN0("[rcu_stop_adv] stop adv command sent failed");
        }
    }
    else
    {
        APP_PRINT_WARN1("[rcu_stop_adv] Invalid RCU status: %d", app_global_data.rcu_status);
    }

    return result;
}

/**
 * @brief terminate connection
 */
bool rcu_terminate_connection(T_DISCONN_REASON disconn_reason)
{
    bool result = false;
    app_global_data.disconn_reason = disconn_reason;

    if ((app_global_data.rcu_status == RCU_STATUS_CONNECTED)
        || (app_global_data.rcu_status == RCU_STATUS_PAIRED))
    {
        if (le_disconnect(0) == GAP_CAUSE_SUCCESS)
        {
            APP_PRINT_INFO0("[rcu_terminate_connection] terminate command sent successfully");
            result = true;
        }
        else
        {
            APP_PRINT_WARN0("[rcu_terminate_connection] terminate command sent failed");
        }
    }
    else
    {
        APP_PRINT_WARN1("[rcu_terminate_connection] Invalid RCU status: %d", app_global_data.rcu_status);
    }

    return result;

