lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/app/rcu/rcu_gap.c
}



/**
 * @brief update peripheral connection parameters
 * @param interval - connection interval; latency - peripheral connection latency
 * @return none
 */
void rcu_update_conn_params(uint16_t interval, uint16_t latency, uint16_t timeout)
{
    if (GAP_CAUSE_SUCCESS != le_update_conn_param(0, interval, interval, latency, timeout / 10,
                                                  interval * 2 - 2,
                                                  interval * 2 - 2))
    {
        if (app_global_data.updt_conn_params_retry_cnt < MAX_UPDATE_CONN_PARAMS_RETRY_CNT)
        {
            app_global_data.updt_conn_params_retry_cnt++;
            APP_PRINT_WARN0("[rcu_update_conn_params] send HCI command retry");
            os_timer_restart(&update_conn_params_timer, UPDATE_CONN_PARAMS_TIMEOUT);
        }
        else
        {
            APP_PRINT_WARN0("[rcu_update_conn_params] send HCI command failed");
        }
    }
}

#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
/**
 * @brief get bond information
 * @param none
 * @return none
 */
void get_bond_info(void)
{
    uint8_t idx = 0;
    T_LE_KEY_ENTRY *p_entry = NULL;

    APP_PRINT_WARN0("[bond info] get_bond_info");

    if (app_global_data.is_link_key_existed)
    {
        app_global_data.bond_info_length = le_get_dev_bond_info_len();//FTL_PAIRED_INFO_LEN
        app_global_data.p_last_bond_info = os_mem_alloc(RAM_TYPE_DATA_ON, app_global_data.bond_info_length);

        p_entry = le_find_key_entry_by_idx(idx);
        if ((app_global_data.p_last_bond_info != NULL) && (p_entry != NULL))
        {
            bool result = le_get_dev_bond_info(p_entry, app_global_data.p_last_bond_info);
            if (result)
            {
                /* get bond information successfully, and delete bond information */
                is_need_delete_last_bond_info = true;
                ftl_save(app_global_data.p_last_bond_info, FTL_PAIRED_INFO_OFFSET, FTL_PAIRED_INFO_LEN);
            }
            else
            {
                os_mem_free(app_global_data.p_last_bond_info);
            }
        }
    }
}

/**
 * @brief delete last bond information
 * @param none
 * @return none
 */
void delete_last_bond_info(void)
{
    APP_PRINT_WARN0("[bond info] delete_last_bond_info");

    if (is_need_delete_last_bond_info)
    {
        is_need_delete_last_bond_info = false;
        os_mem_free(app_global_data.p_last_bond_info);
        memset(app_global_data.p_last_bond_info, 0, FTL_PAIRED_INFO_LEN);
        ftl_save(app_global_data.p_last_bond_info, FTL_PAIRED_INFO_OFFSET, FTL_PAIRED_INFO_LEN);
    }
}

/**
 * @brief set bond information
 * @param none
 * @return none
 */
void set_bond_info(void)
{
    bool exist = false;
    T_LE_KEY_ENTRY *p_entry = NULL;

    if (is_first_check_bond_info)
    {
        APP_PRINT_WARN0("[bond info] is_first_check_bond_info");
        is_first_check_bond_info = false;
        app_global_data.p_last_bond_info = os_mem_alloc(RAM_TYPE_DATA_ON, FTL_PAIRED_INFO_LEN);
        ftl_load(app_global_data.p_last_bond_info, FTL_PAIRED_INFO_OFFSET, FTL_PAIRED_INFO_LEN);
        T_LE_KEY_ENTRY *p_entry1 = (T_LE_KEY_ENTRY *)app_global_data.p_last_bond_info;
        if (p_entry1->is_used != 0 || p_entry1->idx != 0 || p_entry1->flags != 0 ||
            p_entry1->local_bd_type != 0
            || p_entry1->app_data != 0 || p_entry1->remote_bd.bond_flags != 0 ||
            p_entry1->remote_bd.remote_bd_type != 0
            || p_entry1->resolved_remote_bd.bond_flags != 0 || p_entry1->resolved_remote_bd.remote_bd_type != 0)
        {
            is_need_delete_last_bond_info = true;
        }
        else
        {
            os_mem_free(app_global_data.p_last_bond_info);
        }
    }
    if (is_need_delete_last_bond_info)
    {
        APP_PRINT_WARN0("[bond info] set_bond_info");
        p_entry = le_set_dev_bond_info(FTL_PAIRED_INFO_LEN, app_global_data.p_last_bond_info,
                                       &exist);
        if ((p_entry != NULL) && (!exist))
        {
#if FEATURE_SUPPORT_PRIVACY
            /* set bond information successfully */
            privacy_handle_bond_modify_msg(LE_BOND_ADD, p_entry, true);
#else
            app_handle_bond_modify_msg(LE_BOND_ADD, p_entry);
#endif
            app_global_data.is_link_key_existed = true;
        }
        delete_last_bond_info();
    }
}
#endif

